import { clsx, type ClassValue } from "clsx";
import { twMerge } from "tailwind-merge";

export function cn(...inputs: ClassValue[]) {
  return twMerge(clsx(inputs));
}

export const serviceItems = [
  { title: "نقل اثاث المنزل في دبي", href: "/خدمات/نقل-اثاث-المنزل-في-دبي" },
  { title: "نقل اثاث الشقق في دبي", href: "/خدمات/نقل-اثاث-الشقق-في-دبي" },
  { title: "نقل اثاث الفلل في دبي", href: "/خدمات/نقل-اثاث-الفلل-في-دبي" },
  { title: "نقل اثاث المكاتب في دبي", href: "/خدمات/نقل-اثاث-المكاتب-في-دبي" },
  { title: "تغليف اثاث في دبي", href: "/خدمات/تغليف-اثاث-في-دبي" },
  { title: "فك وتركيب اثاث في دبي", href: "/خدمات/فك-وتركيب-اثاث-في-دبي" },
  { title: "تخزين اثاث في دبي", href: "/خدمات/تخزين-اثاث-في-دبي" },
];

export const locationItems = [
  { title: "نقل اثاث ابوظبي", href: "/نقل-اثاث-ابوظبي" },
  { title: "نقل اثاث الشارقة", href: "/نقل-اثاث-الشارقة" },
  { title: "نقل اثاث عجمان", href: "/نقل-اثاث-عجمان" },
  { title: "نقل اثاث راس الخيمة", href: "/نقل-اثاث-راس-الخيمة" },
  { title: "نقل اثاث العين", href: "/نقل-اثاث-العين" },
  { title: "نقل الاثاث ام القيوين", href: "/نقل-الاثاث-ام-القيوين" },
  { title: "نقل الاثاث الفجيرة", href: "/نقل-الاثاث-الفجيرة" },
];
